mahdi-benhassen/esp-agrinet-zigbee-glm5.2/nodes/actuator_node/sdkconfig.defaults
# Actuator node sdkconfig defaults
# Target: ESP32-H2

CONFIG_IDF_TARGET="esp32h2"

# Zigbee router (mains-powered)
CONFIG_ZB_ENABLED=y
CONFIG_ZB_ROUTER=y
CONFIG_ZB_CHANNEL=15
CONFIG_ZB_PAN_ID=0x1A2B
CONFIG_ZB_TX_POWER=20

# Console
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_LOG_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# LEDC
CONFIG_LEDC_CTRL_FUNC_IN_IRAM=y

# Partition
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# Flash size (ESP32-H2 DevKitM-1 has 4MB)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# NVS
CONFIG_NVS_ENCRYPTION=n

# FreeRTOS
CONFIG_FREERTOS_HZ=100

# Watchdog
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
